{
    "hello": "Hello! How can I help you today?",
    "hi": "Hi there! What can I do for you?",
    "hey": "Hey! How's it going?",
    "good morning": "Good morning! Hope you have a great day ahead!",
    "good afternoon": "Good afternoon! How can I assist you?",
    "good evening": "Good evening! What brings you here today?",
    "how are you": "I'm doing well, thank you! I'm here and ready to help. How are you?",
    "what is your name": "I'm a helpful chatbot assistant. You can call me GIGANIGA!",
    "who are you": "I'm a chatbot designed to answer questions and have conversations with you.",
    "who made you": "I was created by a developer to help answer questions and assist users.",
    "what can you do": "I can answer questions, help with general knowledge, do basic math, and have conversations with you!",
    "help": "I'm here to help! You can ask me questions about general knowledge, math, or just chat with me.",
    "help me": "I'd be happy to help! What do you need assistance with?",
    "bye": "Goodbye! Have a wonderful day!",
    "goodbye": "Goodbye! Take care and see you later!",
    "see you later": "See you later! Have a great day!",
    "take care": "You too! Take care and stay safe!",
    "thank you": "You're very welcome! Happy to help!",
    "thanks": "You're welcome! Glad I could assist!",
    "appreciate it": "My pleasure! Always happy to help!",
    "how old are you": "I'm a chatbot, so I don't have an age in the traditional sense!",
    "where are you from": "I exist in the digital world, so I'm from wherever you access me!",
    "what time is it": "I don't have access to real-time data, but you can check your device's clock!",
    "what day is it": "I don't have access to current date information, please check your calendar!",
    "1 + 1": "2",
    "2 + 2": "4",
    "3 + 3": "6",
    "5 + 5": "10",
    "10 + 10": "20",
    "7 + 3": "10",
    "8 + 2": "10",
    "9 + 1": "10",
    "6 + 4": "10",
    "12 + 8": "20",
    "15 + 15": "30",
    "20 - 5": "15",
    "10 - 3": "7",
    "100 / 10": "10",
    "5 * 5": "25",
    "3 * 3": "9",
    "2 * 4": "8",
    "what is the capital of india": "New Delhi is the capital of India.",
    "what is the capital of usa": "Washington D.C. is the capital of the United States.",
    "what is the capital of france": "Paris is the capital of France.",
    "what is the capital of japan": "Tokyo is the capital of Japan.",
    "what is the capital of china": "Beijing is the capital of China.",
    "what is the capital of russia": "Moscow is the capital of Russia.",
    "what is the capital of germany": "Berlin is the capital of Germany.",
    "what is the capital of italy": "Rome is the capital of Italy.",
    "what is the capital of spain": "Madrid is the capital of Spain.",
    "what is the capital of australia": "Canberra is the capital of Australia.",
    "who is the president of india": "The President of India is the ceremonial head of state. For current information, please check recent news.",
    "who is the prime minister of india": "For current information about India's Prime Minister, please check recent news.",
    "largest country in the world": "Russia is the largest country in the world by land area.",
    "smallest country in the world": "Vatican City is the smallest country in the world.",
    "tallest mountain": "Mount Everest is the tallest mountain in the world.",
    "longest river": "The Nile River is generally considered the longest river in the world.",
    "largest ocean": "The Pacific Ocean is the largest ocean in the world.",
    "what is ai": "AI stands for Artificial Intelligence - technology that enables machines to perform tasks that typically require human intelligence.",
    "what is computer": "A computer is an electronic device that processes data and performs calculations according to programmed instructions.",
    "what is internet": "The Internet is a global network of interconnected computers that allows worldwide communication and information sharing.",
    "what is programming": "Programming is the process of creating instructions for computers to follow, written in programming languages.",
    "tell me a joke": "Why don't scientists trust atoms? Because they make up everything!",
    "another joke": "Why did the math book look so sad? Because it had too many problems!",
    "funny joke": "What do you call a bear with no teeth? A gummy bear!",
    "what is love": "Love is a complex emotion involving deep affection, care, and attachment to someone or something.",
    "what is happiness": "Happiness is a positive emotional state characterized by joy, satisfaction, and contentment.",
    "meaning of life": "The meaning of life is a philosophical question that people have pondered for centuries. Many find meaning through relationships, purpose, and personal growth.",
    "how to be happy": "Happiness often comes from maintaining good relationships, pursuing meaningful goals, practicing gratitude, and taking care of your physical and mental health.",
    "how to learn programming": "Start with beginner-friendly languages like Python, practice regularly, work on projects, and use online resources and tutorials.",
    "how to study effectively": "Create a schedule, find a quiet space, take regular breaks, use active recall techniques, and stay consistent with your efforts.",
    "what is python": "Python is a popular, easy-to-learn programming language known for its simple syntax and versatility.",
    "what is javascript": "JavaScript is a programming language primarily used for web development to make websites interactive.",
    "what is html": "HTML (HyperText Markup Language) is the standard language for creating web pages and web applications.",
    "tell me about space": "Space is the vast, mostly empty expanse that exists beyond Earth's atmosphere, containing stars, planets, galaxies, and other celestial objects.",
    "what is a black hole": "A black hole is a region in space where gravity is so strong that nothing, not even light, can escape once it crosses the event horizon.",
    "how many planets": "There are 8 planets in our solar system: Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, and Neptune.",
    "what is photosynthesis": "Photosynthesis is the process by which plants use sunlight, water, and carbon dioxide to produce glucose and oxygen.",
    "what is gravity": "Gravity is a fundamental force that attracts objects with mass toward each other.",
    "speed of light": "The speed of light in a vacuum is approximately 299,792,458 meters per second.",
    "healthy food": "Healthy foods include fruits, vegetables, whole grains, lean proteins, nuts, and foods rich in vitamins and minerals.",
    "importance of exercise": "Regular exercise helps maintain physical fitness, mental health, and reduces the risk of various diseases.",
    "how much water to drink": "It's generally recommended to drink about 8 glasses (64 ounces) of water per day, though individual needs may vary.",
    "what is meditation": "Meditation is a practice of focused attention and mindfulness that can help reduce stress and improve mental clarity.",
    "benefits of reading": "Reading improves vocabulary, knowledge, mental stimulation, stress reduction, and can enhance empathy and imagination.",
    "importance of sleep": "Adequate sleep is crucial for physical health, mental function, emotional well-being, and overall quality of life.",
    "i am sad": "I'm sorry to hear you're feeling sad. It's normal to have difficult emotions sometimes. Consider talking to someone you trust or engaging in activities you enjoy.",
    "i am happy": "That's wonderful! I'm glad to hear you're feeling happy. Keep enjoying those positive moments!",
    "i am tired": "Rest is important! Make sure you're getting enough sleep and taking breaks when you need them.",
    "i am bored": "When you're bored, try reading a book, learning something new, going for a walk, or picking up a hobby you enjoy!",
    "weather": "I don't have access to current weather information. Please check your local weather app or website for accurate forecasts.",
    "time": "I don't have access to real-time information. Please check your device's clock for the current time.",
    "date today": "I don't have access to current date information. Please check your calendar or device for today's date.",
    "favorite color": "I don't have personal preferences as a chatbot, but I think all colors are interesting in their own way!",
    "favorite food": "As a chatbot, I don't eat, but I find it fascinating how diverse and creative human cuisine can be!",
    "do you eat": "No, I'm a chatbot so I don't eat food. But I'd love to hear about your favorite foods!",
    "do you sleep": "No, I don't sleep since I'm a computer program. I'm available whenever you need assistance!",
    "yes": "Great! How can I help you further?",
    "no": "No problem! Is there anything else I can assist you with?",
    "ok": "Okay! What would you like to talk about or ask?",
    "okay": "Alright! What can I do for you?",
    "cool": "Cool indeed! Anything else you'd like to know?",
    "awesome": "Awesome! What else can we chat about?",
    "nice": "Nice! Is there anything specific you'd like to discuss?",
    "tell me something interesting": "Did you know that honey never spoils? Archaeologists have found pots of honey in ancient Egyptian tombs that are over 3,000 years old and still perfectly edible!",
    "random fact": "Octopuses have three hearts and blue blood! Two hearts pump blood to the gills, while the third pumps blood to the rest of the body.",
    "surprise me": "Here's something amazing: A single cloud can weigh more than a million pounds, but it floats because the water droplets are so small and spread out!",
    "im good": "i am good too"
}